Revit 2026 API

# ConductorSize Properties

---

The ConductorSize type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Diameter | The diameter of the conductor. |
|  | Id | The Conductor Size id. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Name | The Conductor Size name. |

#### Reference

ConductorSize Class

Autodesk.Revit.DB.Electrical Namespace